In [2]:
%load_ext sql

In [3]:
%sql mysql+mysqldb://root:root@localhost/gdb023

### Visualize all the table from database.

### 1) dim_customer table

In [5]:
%sql select*from dim_customer LIMIT 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[(70002017, 'Atliq Exclusive', 'Brick & Mortar', 'Direct', 'India', 'India', 'APAC'),
 (70002018, 'Atliq e Store', 'E-Commerce', 'Direct', 'India', 'India', 'APAC'),
 (70003181, 'Atliq Exclusive', 'Brick & Mortar', 'Direct', 'Indonesia', 'ROA', 'APAC'),
 (70003182, 'Atliq e Store', 'E-Commerce', 'Direct', 'Indonesia', 'ROA', 'APAC'),
 (70004069, 'Atliq Exclusive', 'Brick & Mortar', 'Direct', 'Japan', 'ROA', 'APAC')]

### 2) fact_sales_monthly table

In [6]:
%sql select * from fact_sales_monthly limit 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[(datetime.date(2019, 9, 1), 'A0118150101', 70002017, 137, 2020),
 (datetime.date(2019, 9, 1), 'A0118150101', 70002018, 47, 2020),
 (datetime.date(2019, 9, 1), 'A0118150101', 70003181, 57, 2020),
 (datetime.date(2019, 9, 1), 'A0118150101', 70003182, 63, 2020),
 (datetime.date(2019, 9, 1), 'A0118150101', 70004069, 9, 2020)]

### 3) dim_product table

In [7]:
%sql select * from dim_product limit 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[('A0118150101', 'P & A', 'Peripherals', 'Internal HDD', 'AQ Dracula HDD – 3.5 Inch SATA 6 Gb/s 5400 RPM 256 MB Cache', 'Standard'),
 ('A0118150102', 'P & A', 'Peripherals', 'Internal HDD', 'AQ Dracula HDD – 3.5 Inch SATA 6 Gb/s 5400 RPM 256 MB Cache', 'Plus'),
 ('A0118150103', 'P & A', 'Peripherals', 'Internal HDD', 'AQ Dracula HDD – 3.5 Inch SATA 6 Gb/s 5400 RPM 256 MB Cache', 'Premium'),
 ('A0118150104', 'P & A', 'Peripherals', 'Internal HDD', 'AQ Dracula HDD – 3.5 Inch SATA 6 Gb/s 5400 RPM 256 MB Cache', 'Premium Plus'),
 ('A0219150201', 'P & A', 'Peripherals', 'Internal HDD', 'AQ WereWolf NAS Internal Hard Drive HDD – 8.89 cm', 'Standard')]

### 4) fact_manufacturing_cost table

In [8]:
%sql select * from fact_manufacturing_cost limit 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[('A0118150101', 2020, Decimal('5.0207')),
 ('A0118150101', 2021, Decimal('5.5172')),
 ('A0118150102', 2020, Decimal('5.7180')),
 ('A0118150102', 2021, Decimal('6.2835')),
 ('A0118150103', 2020, Decimal('6.3264'))]

### 5) fact_pre_invoice_deduction table

In [9]:
%sql select * from fact_pre_invoice_deductions limit 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[(70002017, 2020, Decimal('0.0735')),
 (70002017, 2021, Decimal('0.0703')),
 (70002018, 2020, Decimal('0.2255')),
 (70002018, 2021, Decimal('0.2061')),
 (70003181, 2020, Decimal('0.0531'))]

### 6) fact_gross_price table

In [10]:
%sql select * from fact_gross_price limit 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[('A0118150101', 2020, Decimal('16.2323')),
 ('A0118150101', 2021, Decimal('19.0573')),
 ('A0118150102', 2020, Decimal('19.8577')),
 ('A0118150102', 2021, Decimal('21.4565')),
 ('A0118150103', 2020, Decimal('22.1317'))]

### Questions

#### 1)Provide the list of markets in which customer "Atliq Exclusive" operates its business in the APAC region.

In [12]:
%%sql 

SELECT DISTINCT(market) from dim_customer
where customer="Atliq Exclusive" and region="APAC";

 * mysql+mysqldb://root:***@localhost/gdb023
8 rows affected.

[('India',),
 ('Indonesia',),
 ('Japan',),
 ('Philiphines',),
 ('South Korea',),
 ('Australia',),
 ('Newzealand',),
 ('Bangladesh',)]

#### 2)What is the percentage of unique product increase in 2021 vs. 2020? 
#### The final output contains these fields : 1) unique_products_2020 2) unique_products_2021 3)percentage_chg

In [14]:
%%sql

## CTE to count unique product in 2020
WITH  unique_products_2020 AS (
    SELECT COUNT(DISTINCT product_code) AS unique_products_2020
    FROM fact_sales_monthly
    WHERE fiscal_year = 2020
),

## CTE to count unique products in 2021
unique_products_2021 AS (
    SELECT COUNT(DISTINCT product_code) AS unique_products_2021
    FROM fact_sales_monthly
    WHERE fiscal_year = 2021
)

## Final select to calculate percentage change
SELECT 
    up2020.unique_products_2020,
    up2021.unique_products_2021,
    ROUND(
        (up2021.unique_products_2021 - up2020.unique_products_2020) / up2020.unique_products_2020 * 100, 2
    ) AS percentage_chg
FROM 
    unique_products_2020 AS up2020,
    unique_products_2021 AS up2021;

 * mysql+mysqldb://root:***@localhost/gdb023
1 rows affected.

[(245, 334, Decimal('36.33'))]

#### 3)Provide a report with all the unique product counts for each segment and sort them in descending order of product counts. 
####    Final output contains 2 fields : 1)segment 2)product_count

In [16]:
%%sql

SELECT COUNT(DISTINCT PRODUCT_CODE) AS UNIQUE_PRODUCT,SEGMENT
FROM DIM_PRODUCT
GROUP BY SEGMENT
ORDER BY UNIQUE_PRODUCT DESC;

 * mysql+mysqldb://root:***@localhost/gdb023
6 rows affected.

[(129, 'Notebook'),
 (116, 'Accessories'),
 (84, 'Peripherals'),
 (32, 'Desktop'),
 (27, 'Storage'),
 (9, 'Networking')]

#### 4)Which segment had the most increase in unique products in 2021 vs 2020? 
#### The final output contains these fields : 1) segment product_count_2020 2) product_count_2021 3)difference

In [30]:
%%sql

WITH CTE AS (
    SELECT dp.segment, COUNT(DISTINCT dp.product_code) AS product_count_2020
    FROM dim_product dp
    JOIN fact_sales_monthly fsm ON dp.product_code = fsm.product_code
    WHERE fsm.fiscal_year = 2020
    GROUP BY dp.segment),

unique_products_2021 AS (
    SELECT dp.segment, COUNT(DISTINCT dp.product_code) AS product_count_2021
    FROM dim_product dp
    JOIN fact_sales_monthly fsm ON dp.product_code = fsm.product_code
    WHERE fsm.fiscal_year = 2021
    GROUP BY dp.segment)

SELECT 
    u2020.segment,
    u2020.product_count_2020,
    COALESCE(u2021.product_count_2021, 0) AS product_count_2021,
    COALESCE(u2021.product_count_2021, 0) - u2020.product_count_2020 AS difference
FROM 
    CTE u2020
LEFT JOIN 
    unique_products_2021 u2021 ON u2020.segment = u2021.segment
ORDER BY 
    difference DESC;

 * mysql+mysqldb://root:***@localhost/gdb023
6 rows affected.

[('Accessories', 69, 103, 34),
 ('Notebook', 92, 108, 16),
 ('Peripherals', 59, 75, 16),
 ('Desktop', 7, 22, 15),
 ('Storage', 12, 17, 5),
 ('Networking', 6, 9, 3)]

#### 5)Get the products that have the highest and lowest manufacturing costs.
#### The final output should contain these fields: 1)product_code  2)product  3)manufacturing_cost

In [36]:
%%sql

(SELECT DP.PRODUCT_CODE, DP.PRODUCT, FMC.manufacturing_cost  
FROM DIM_PRODUCT DP JOIN FACT_MANUFACTURING_COST FMC 
ON DP.PRODUCT_CODE = FMC.PRODUCT_CODE
ORDER BY FMC.MANUFACTURING_COST DESC
LIMIT 1)

UNION

(SELECT DP.PRODUCT_CODE, DP.PRODUCT, FMC.manufacturing_cost  
FROM DIM_PRODUCT DP JOIN FACT_MANUFACTURING_COST FMC 
ON DP.PRODUCT_CODE = FMC.PRODUCT_CODE
ORDER BY FMC.MANUFACTURING_COST ASC
LIMIT 1);

 * mysql+mysqldb://root:***@localhost/gdb023
2 rows affected.

[('A6120110206', 'AQ HOME Allin1 Gen 2', Decimal('240.5364')),
 ('A2118150101', 'AQ Master wired x1 Ms', Decimal('0.8920'))]

#### 6)Generate a report which contains the top 5 customers who received an average high pre_invoice_discount_pct for the fiscal year 2021 and in the Indian market. 
#### The final output contains these fields: 1)customer_code  2)customer  3)average_discount_percentage.

In [55]:
%%sql

SELECT  dc.customer_code, dc.customer,
    AVG(pcid.pre_invoice_discount_pct) AS average_discount_percentage
FROM dim_customer dc JOIN  fact_pre_invoice_deductions pcid 
    ON dc.customer_code = pcid.customer_code
WHERE 
    pcid.fiscal_year = 2021 AND dc.market = 'India'
GROUP BY 
    dc.customer_code, dc.customer
ORDER BY 
    average_discount_percentage DESC
LIMIT 5;

 * mysql+mysqldb://root:***@localhost/gdb023
5 rows affected.

[(90002009, 'Flipkart', Decimal('0.30830000')),
 (90002006, 'Viveks', Decimal('0.30380000')),
 (90002003, 'Ezone', Decimal('0.30280000')),
 (90002002, 'Croma', Decimal('0.30250000')),
 (90002016, 'Amazon ', Decimal('0.29330000'))]

#### 7)Get the complete report of the Gross sales amount for the customer “Atliq Exclusive” for each month . 
#### This analysis helps to get an idea of low and high-performing months and take strategic decisions. 
#### The final report contains these columns: 1)Month  2) Year  3) Gross sales Amount.

In [58]:
%%sql

SELECT 
    DATE_FORMAT(fsm.date, '%Y-%m') AS Month,
    YEAR(fsm.date) AS Year,
    SUM(fsm.sold_quantity * fgt.gross_price) AS Gross_Sales_Amount
FROM 
    fact_sales_monthly fsm
JOIN 
    dim_customer dc ON fsm.customer_code = dc.customer_code
JOIN 
    fact_gross_price fgt ON fsm.product_code = fgt.product_code AND fsm.fiscal_year = fgt.fiscal_year
WHERE 
    dc.customer = 'Atliq Exclusive'
GROUP BY 
    DATE_FORMAT(fsm.date, '%Y-%m'), YEAR(fsm.date)
ORDER BY 
    Year, Month;

 * mysql+mysqldb://root:***@localhost/gdb023
24 rows affected.

[('2019-09', 2019, Decimal('4496259.6724')),
 ('2019-10', 2019, Decimal('5135902.3467')),
 ('2019-11', 2019, Decimal('7522892.5608')),
 ('2019-12', 2019, Decimal('4830404.7285')),
 ('2020-01', 2020, Decimal('4740600.1605')),
 ('2020-02', 2020, Decimal('3996227.7661')),
 ('2020-03', 2020, Decimal('378770.9700')),
 ('2020-04', 2020, Decimal('395035.3535')),
 ('2020-05', 2020, Decimal('783813.4238')),
 ('2020-06', 2020, Decimal('1695216.6008')),
 ('2020-07', 2020, Decimal('2551159.1584')),
 ('2020-08', 2020, Decimal('2786648.2601')),
 ('2020-09', 2020, Decimal('12353509.7938')),
 ('2020-10', 2020, Decimal('13218636.1966')),
 ('2020-11', 2020, Decimal('20464999.0997')),
 ('2020-12', 2020, Decimal('12944659.6509')),
 ('2021-01', 2021, Decimal('12399392.9788')),
 ('2021-02', 2021, Decimal('10129735.5675')),
 ('2021-03', 2021, Decimal('12144061.2501')),
 ('2021-04', 2021, Decimal('7311999.9547')),
 ('2021-05', 2021, Decimal('12150225.0139')),
 ('2021-06', 2021, Decimal('9824521.0110')),
 ('2021-07', 2021, Decimal('12092346.3245')),
 ('2021-08', 2021, Decimal('7178707.5902'))]

#### 8)In which quarter of 2020, got the maximum total_sold_quantity? 
#### The final output contains these fields sorted by the total_sold_quantity, Quarter total_sold_quantity.

In [61]:
%%sql

select quarter(date) as quarter,sum(sold_quantity) as total_sold_quantity
from fact_sales_monthly
group by quarter
order by total_sold_quantity desc;

 * mysql+mysqldb://root:***@localhost/gdb023
4 rows affected.

[(4, Decimal('25872947')),
 (3, Decimal('16271564')),
 (1, Decimal('14565784')),
 (2, Decimal('14227176'))]

#### 9) Which channel helped to bring more gross sales in the fiscal year 2021 and the percentage of contribution? 
#### The final output contains these fields: 1)channel 2)gross_sales_mln 3)percentage.

In [70]:
%%sql

WITH sales_2021 AS (
    SELECT 
        dc.channel,
        SUM(fsm.sold_quantity) AS gross_sales
    FROM  dim_customer dc
    JOIN  fact_sales_monthly fsm
    ON dc.customer_code = fsm.customer_code
    WHERE  fsm.fiscal_year = 2021
    GROUP BY dc.channel),

overall_sales AS (
    SELECT 
        SUM(gross_sales) AS total_gross_sales
    FROM sales_2021)

SELECT
    s.channel,
    ROUND(s.gross_sales / 1000000, 2) AS gross_sales_mln,
    ROUND((s.gross_sales / o.total_gross_sales) * 100, 2) AS percentage
FROM
    sales_2021 s,
    overall_sales o
ORDER BY gross_sales_mln DESC;

 * mysql+mysqldb://root:***@localhost/gdb023
3 rows affected.

[('Retailer', Decimal('36.79'), Decimal('73.34')),
 ('Direct', Decimal('7.74'), Decimal('15.44')),
 ('Distributor', Decimal('5.63'), Decimal('11.23'))]

#### 10) Get the Top 3 products in each division that have a high total_sold_quantity in the fiscal_year 2021? 
#### The final output contains these fields: 1)division product_code 2) product 3)total_sold_quantity 4)rank_order.

In [79]:
%%sql

WITH ranked_products AS (
    SELECT  dp.division,fsm.product_code,dp.product,
        SUM(fsm.sold_quantity) AS total_sold_quantity,
        RANK() OVER (PARTITION BY dp.division ORDER BY SUM(fsm.sold_quantity) DESC) AS rank_order
    FROM 
        fact_sales_monthly fsm JOIN dim_product dp 
    ON fsm.product_code = dp.product_code
    WHERE fsm.fiscal_year = 2021
    GROUP BY 
        dp.division, fsm.product_code, dp.product)
SELECT 
    division,product_code,product,total_sold_quantity,rank_order
FROM 
    ranked_products
WHERE 
    rank_order <= 3
ORDER BY 
    division, rank_order;

 * mysql+mysqldb://root:***@localhost/gdb023
9 rows affected.

[('N & S', 'A6720160103', 'AQ Pen Drive 2 IN 1', Decimal('701373'), 1),
 ('N & S', 'A6818160202', 'AQ Pen Drive DRC', Decimal('688003'), 2),
 ('N & S', 'A6819160203', 'AQ Pen Drive DRC', Decimal('676245'), 3),
 ('P & A', 'A2319150302', 'AQ Gamers Ms', Decimal('428498'), 1),
 ('P & A', 'A2520150501', 'AQ Maxima Ms', Decimal('419865'), 2),
 ('P & A', 'A2520150504', 'AQ Maxima Ms', Decimal('419471'), 3),
 ('PC', 'A4218110202', 'AQ Digit', Decimal('17434'), 1),
 ('PC', 'A4319110306', 'AQ Velocity', Decimal('17280'), 2),
 ('PC', 'A4218110208', 'AQ Digit', Decimal('17275'), 3)]